Управление_торговлей_демо/src/Documents/ИнвентаризацияПродукцииВЕТИС/ИнвентаризацияПродукцииВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияПродукцииВЕТИС</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>InformationRegister.ЗаписиСкладскогоЖурналаВРезервеВЕТИС</registerRecords>
  <attributes>
    <name>ДатаАктаНесоответствия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеИнвентаризацияПродукцииВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАктаНесоответствия</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоответствия</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияАктаНесоответствия</name>
    <type>
      <types>DefinedType.СерияАктаНесоответствияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.ОперацииИнвентаризацииПродукцииВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурнала</name>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатурыВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзменение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзменениеВЕТИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВЕТИС</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваСтрока</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваТочностьЗаполнения</name>
      <type>
        <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваНачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваКонецПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиСтрока</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиТочностьЗаполнения</name>
      <type>
        <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиНачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиКонецПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводства</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СкоропортящаясяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НизкокачественнаяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурналаАрхив</name>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВетеринарноСопроводительныйДокумент</name>
      <type>
        <types>CatalogRef.ВетеринарноСопроводительныйДокументВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УпаковкиВЕТИС</name>
    <attributes>
      <name>ИдентификаторСтрокиТовары</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньУпаковки</name>
      <type>
        <types>EnumRef.УровниУпаковокВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаВЕТИС</name>
      <type>
        <types>CatalogRef.УпаковкиВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокВЕТИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиУпаковокВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Производители</name>
    <attributes>
      <name>ИдентификаторСтрокиТовары</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПредприятия</name>
      <type>
        <types>EnumRef.РолиПредприятийВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизводственныеПартии</name>
    <attributes>
      <name>ИдентификаторСтрокиТовары</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПартии</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_демо/src/CommonModules/ИнтеграцияИСКлиентСерверПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СерииНоменклатуры

// Для некоторых видов документов может быль более одного набора параметров указания серий. 
// Нужно явно указать одну из них.
//
// Параметры:
//  ПараметрыУказанияСерий - Структура - изменяемое(возвращаемое) значение
//  Контекст - ФормаКлиентскогоПриложения
Процедура ПриОпределенииПараметровУказанияСерий(ПараметрыУказанияСерий, Контекст) Экспорт
	
	//++ НЕ ГОСИС
	Если Контекст.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		ПараметрыУказанияСерий = Контекст.ПараметрыУказанияСерий.ОтгружаемыеТовары;
	ИначеЕсли Контекст.ИмяФормы = "Документ.ОтборРазмещениеТоваров.Форма.ФормаДокумента" Тогда
		ПараметрыУказанияСерий = Контекст.ПараметрыУказанияСерий.Отбор;
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СерииНоменклатуры

// Процедура устанавливает использование статусов серий необязательного вида "Можно указать"
// для объектов метаданных подсистемы ГосИС
//
// Параметры:
//  Использовать - Булево - разрешить использование статусов
//  ПараметрыУказанияСерий - Произвольный - Параметры указания серий.
Процедура ИспользоватьСтатусСерийМожноУказать(Использовать, ПараметрыУказанияСерий) Экспорт
	
	//++ НЕ ГОСИС
	// (См. НоменклатураКлиентСервер.ПараметрыУказанияСерий)
	Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ВходящаяТранспортнаяОперацияВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗапросСкладскогоЖурналаВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ИнвентаризацияПродукцииВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПроизводственнаяОперацияВЕТИС"
		Или (СтрНачинаетсяС(ПараметрыУказанияСерий.ПолноеИмяОбъекта, "Обработка.ПроверкаИПодборПродукцииИСМП")
			Или СтрНачинаетсяС(ПараметрыУказанияСерий.ПолноеИмяОбъекта, "Обработка.ВиртуальнаяАгрегацияУпаковокИСМП")
			Или СтрНачинаетсяС(ПараметрыУказанияСерий.ПолноеИмяОбъекта, "Обработка.ПроверкаИПодборТабачнойПродукцииМОТП"))
			И ПараметрыУказанияСерий.ИмяПоляСклад = Неопределено
		Тогда
		Использовать = Истина;
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;

КонецПроцедуры

// Функция проверяет необходимость указания серии в строке по статусу.
//
// Параметры:
//  ТребуетсяУказать    - Булево - в этом статусе требуется указание серий.
//  СтатусУказанияСерий - Число  - статус указания серии в строке табличной части
//
Процедура ПроверитьНеобходимоУказатьСерию(ТребуетсяУказать, СтатусУказанияСерий) Экспорт
	
	//++ НЕ ГОСИС
	ТребуетсяУказать = НоменклатураКлиентСервер.СтатусыСерийСерияНеУказана().Найти(СтатусУказанияСерий)<>Неопределено;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

// В процедуре требуется определить признак использования серий по параметрам указания серий
//
// Параметры:
//  Использование - Булево - Признак использования серий
//  ПараметрыУказанияСерий - Произвольный - Параметры указания серий объекта конфигурации.
//
Процедура ИспользованиеСерийПоПараметрамУказанияСерий(Использование, ПараметрыУказанияСерий) Экспорт
	
	//++ НЕ ГОСИС
	Если ПараметрыУказанияСерий=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыУказанияСерий.Свойство("ИспользоватьСерииНоменклатуры") Тогда
		Использование = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	ИначеЕсли ПараметрыУказанияСерий.Свойство("ВыходныеИзделия") Тогда
		Использование = ПараметрыУказанияСерий.ВыходныеИзделия.ИспользоватьСерииНоменклатуры;
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

#КонецОбласти

// Заполняет представление строки номенклатуры.
//
// Параметры:
//  Представление  - Строка                                     - представление для заполнения,
//  Номенклатура   - ОпределяемыйТип.Номенклатура               - ссылка на номенклатуру,
//  Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - ссылка на характеристику номенклатуры,
//  Упаковка       - ОпределяемыйТип.Упаковка                   - ссылка на упаковку.
//  Серия          - ОпределяемыйТип.СерияНоменклатуры          - ссылка на серию номенклатуры.
Процедура ЗаполнитьПредставлениеНоменклатуры(Представление, Номенклатура, Характеристика, Упаковка, Серия) Экспорт
	
	//++ НЕ ГОСИС
	Представление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
		СокрЛП(Номенклатура),
		СокрЛП(Характеристика),
		Упаковка,
		Серия);
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

//Описание: Корректирует имена табличных частей с данными в зависимости от источника.
//Параметры:
//	ПараметрыУказанияСерий - Структура - анализируемые ключи (их наличие обязательно):
//	*ИмяТЧТовары - Строка
//	*ИмяТЧСерии- Строка
//	*ПолноеИмяОбъекта - Строка
Процедура ПараметрыУказанияСерийЗаменитьИмяТЧ(ПараметрыУказанияСерий) Экспорт
	
	//++ НЕ ГОСИС
	Если ТипЗнч(ПараметрыУказанияСерий) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыУказанияСерий.Свойство("ПолноеИмяОбъекта")
		ИЛИ НЕ ПараметрыУказанияСерий.Свойство("ИмяТЧТовары")
		ИЛИ НЕ ПараметрыУказанияСерий.Свойство("ИмяТЧСерии") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяДокументаОбъекта = ИнтеграцияИСМПУТКлиентСервер.ИмяДокументаИзПолногоИмениОбъекта(ПараметрыУказанияСерий["ПолноеИмяОбъекта"]); 
	Если ИмяДокументаОбъекта = "РасходныйОрдерНаТовары" Тогда
		ПараметрыУказанияСерий.ИмяТЧТовары = "ОтгружаемыеТовары";
		ПараметрыУказанияСерий.ИмяТЧСерии = "ОтгружаемыеТовары";
	ИначеЕсли ИмяДокументаОбъекта = "ОтборРазмещениеТоваров" Тогда
		ПараметрыУказанияСерий.ИмяТЧТовары = "ТоварыОтбор";
		ПараметрыУказанияСерий.ИмяТЧСерии = "ТоварыОтбор";
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

#КонецОбласти
